In [1]:
# Ignore, this code will be explained later
import os
import sys

module_path = os.path.abspath(os.path.join('../..'))
if module_path not in sys.path: sys.path.append(module_path)

from src import utils

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import random

In [ ]:
%reload_ext post_content
%post_content register YOUR_USER_NAME

# Reshaping dataframes

Creating synthetic data

In [5]:
calories = {
    'Donuts': 195 * 1,
    'Bacon' : 43 * 3,
    'Beer'  : 154 * 1,
    'Salad' : 535 * 1,
    'Pot Roast': 252 * 2,
    'Waffles': 82 * 3,
    'Tofu'  : 94
}

k = 9
homer_food = random.choices(['Donuts', 'Bacon', 'Beer'], k=k*3)
marge_food = random.choices(['Salad', 'Pot Roast', 'Waffles'], k=k)
lisa_food  = random.choices(['Salad', 'Tofu', 'Waffles'], k=k)

days = random.choices(list(range(1,1+int(k/3))), k= k * 3 + k + k)

food_df = pd.DataFrame({
    'day' : days,
    'name': ['Homer'] * k * 3 + ['Marge'] * k + ['Lisa'] * k,
    'food': homer_food + marge_food + lisa_food,
    'calories': list(map(lambda x: calories[x],homer_food)) + list(map(lambda x: calories[x],marge_food)) + list(map(lambda x: calories[x],lisa_food))             
}).sample(frac=1).reset_index().drop(['index'],axis='columns')

#food_df.head()

Same dataset can be shaped in many different ways. For example:

In [19]:
food_1day_df = food_df.loc[food_df['day'] == 1, ['name', 'food', 'calories']].groupby(['name', 'food']).sum().reset_index()

In [20]:
food_1day_df.head()

    name     food  calories
0  Homer    Bacon       258
1  Homer   Donuts       975
2   Lisa    Salad       535
3   Lisa     Tofu       188
4   Lisa  Waffles       492

Perhaps the food column is pivoted

In [21]:
food_1day_df.pivot(index='name', columns='food', values='calories')

food   Bacon  Donuts  Salad   Tofu  Waffles
name
Homer  258.0   975.0    NaN    NaN      NaN
Lisa     NaN     NaN  535.0  188.0    492.0
Marge    NaN     NaN  535.0    NaN    246.0

### `pivot` to turn a column of values into one column per value
#### long to wide

In [27]:
pd.DataFrame({'colA': [1,2,3,4,5],
             'colB': ['catA', 'catB', 'catC', 'catD', 'catE'],
             'colC': ['valA', 'valB', 'valC', 'valD', 'valE']
             })

   colA  colB  colC
0     1  catA  valA
1     2  catB  valB
2     3  catC  valC
3     4  catD  valD
4     5  catE  valE

In [29]:
pd.DataFrame({'colA': [1,2,3,4,5],
             'colB': ['catA', 'catB', 'catC', 'catD', 'catE'],
             'colC': ['valA', 'valB', 'valC', 'valD', 'valE']
             }).pivot(index='colA', columns='colB', values='colC')

colB  catA  catB  catC  catD  catE
colA
1     valA   NaN   NaN   NaN   NaN
2      NaN  valB   NaN   NaN   NaN
3      NaN   NaN  valC   NaN   NaN
4      NaN   NaN   NaN  valD   NaN
5      NaN   NaN   NaN   NaN  valE

**Exercise** Given dataframe `food_1day_df`, change it so each row represents a food and each column represents a Simpson family member and the cells in the table represent calories.

In [ ]:
%%post_content exercise_030_170_a

#type your answer here

### `melt` to turn multiple columns of values into two columns: data name, data value
#### wide to long

In [94]:
food_homer_df = pd.DataFrame({'day':[1,2,3]
                             , 'Bacon':[129,129,129]
                             , 'Beer':[0, 154, 154]
                             , 'Donuts':[195, 0, 195]
                             })

In [95]:
food_homer_df

   day  Bacon  Beer  Donuts
0    1    129     0     195
1    2    129   154       0
2    3    129   154     195

We need to 'unpivot' this using `melt`. Now that you have learned how to pivot a dataframe, how can we think about moving the rows, 'Bacon', 'Beer' and 'Donuts' into a single column containing column headings as entries?

In [97]:
food_homer_df.melt(id_vars='day', var_name='food', value_name='calories')

   day    food  calories
0    1   Bacon       129
1    2   Bacon       129
2    3   Bacon       129
3    1    Beer         0
4    2    Beer       154
5    3    Beer       154
6    1  Donuts       195
7    2  Donuts         0
8    3  Donuts       195

**Exercise** Given `food_homer_df`, change the dataframe so food items appear in rows and day value appear in columns. The final result should like like this (you must use melt/pivot, ignore index names)

In [102]:
pd.DataFrame({'food':['Bacon', 'Beer', 'Donuts'],
              '1':[129, 0, 195],
             '2':[129, 154, 0],
             '3':[129, 154, 195]})

     food    1    2    3
0   Bacon  129  129  129
1    Beer    0  154  154
2  Donuts  195    0  195

In [ ]:
%%post_content exercise_030_170_b

#type your answer here